from typing import List

BOT_TOKEN = '7606985855:AAFNOD3F85iClcyX6kcx_bt7k5_9aI8p_m4'

ALLOWED_USER_IDS: List[int] = [
    1112747052,
    6427854059,
    1003982914,
    6123941736,
    5534988022,
    930048992,
    113198627
]

CHANNEL_CHAT_ID = -1002762926972

MESSAGES = {
    'ACCESS_DENIED': '⛔ دسترسی ندارید.',
    'WELCOME': '🎮 خوش آمدید!\nگزینه‌ای را انتخاب کنید:',
    'SELECT_TABLE_GAME': '🎮 میز بازی را انتخاب کنید:',
    'SELECT_TABLE_ORDER': '🍽 میز سفارش را انتخاب کنید:',
    'SELECT_CATEGORY': '📋 دسته‌بندی را انتخاب کنید:',
    'ENTER_PLAYERS': '👥 تعداد بازیکنان را وارد کنید:',
    'GAME_REGISTERED': '✅ بازی با موفقیت ثبت شد.',
    'ORDER_REGISTERED': '✅ سفارش با موفقیت ثبت شد.',
    'INVALID_NUMBER': '❌ لطفاً یک عدد صحیح و مثبت وارد کنید.',
    'NO_ITEMS_SELECTED': '❗ هیچ آیتمی انتخاب نشده است.',
    'USE_MENU': '⛔ لطفاً از منو استفاده کنید یا دکمه بازگشت را بزنید.',
    'ORDER_ERROR': '❌ خطا در ثبت سفارش. لطفاً دوباره تلاش کنید.'
}